Управление_по_целям_и_KPI/src/Catalogs/KPI_МатрицыРаспределения/KPI_МатрицыРаспределения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>KPI_МатрицыРаспределения</name>
  <predefined>
    <items>
      <name>Оклад</name>
      <description>Оклад</description>
    </items>
    <items>
      <name>РасчетБазы</name>
      <description>Расчет базы</description>
    </items>
  </predefined>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.KPI_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Управление_по_целям_и_KPI/src/Catalogs/KPI_МатрицыРаспределения/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура СотрудникиСотрудникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбъектУправления = KPI_ОбщегоНазначения.ОбработкаВыбораПолучитьСтруктуруКомпанииНаДату(ТекущаяДата(), ЭтаФорма, СтандартнаяОбработка, Истина, ?(ЗначениеЗаполнено(Элементы.Сотрудники.ТекущиеДанные.Сотрудник), KPI_ОбщегоНазначенияСервер.ПолучитьСтруктуруКомпанииПоСотруднику(Элементы.Сотрудники.ТекущиеДанные.Сотрудник), Неопределено));
	
	Если Не ОбъектУправления = Неопределено Тогда
		Элементы.Сотрудники.ТекущиеДанные.Сотрудник = ОбъектУправления.Сотрудник;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.Сотрудники.Итог("Вес") <> 100 Тогда
		Предупреждение("Общий вес должен быть равен 100%!");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры
